Repository: bouhenni1982/physio_manager
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Online
ar: متصل
fr: En ligne

source: Offline
ar: غير متصل
fr: Hors ligne

source: Syncing…
ar: مزامنة…
fr: Synchronisation…

# loginTitle
source: Sign in
ar: تسجيل الدخول
fr: Connexion

# therapistNameLabel
source: Therapist name
ar: اسم المختص
fr: Nom du kinésithérapeute

# emailLabel
source: Email
ar: البريد الإلكتروني

# passwordLabel
source: Password
ar: كلمة المرور
fr: Mot de passe

# loginButton
source: Sign in
ar: تسجيل الدخول
fr: Se connecter

source: Invalid credentials
ar: بيانات غير صحيحة
fr: Identifiants invalides

source: Forgot password?
ar: نسيت كلمة المرور؟
fr: Mot de passe oublié ?

# onlyAdminCreatesAccounts
source: Accounts are created by admin only
ar: إنشاء الحسابات يتم من طرف المسؤول فقط
fr: Les comptes sont créés par l’admin uniquement

# reauthTitle
source: Session locked
ar: الجلسة مقفلة
fr: Session verrouillée

# reauthSubtitle
source: Continue as {email}
ar: المتابعة بالحساب {email}
fr: Continuer avec {email}

# reauthButton
source: Unlock session
ar: فتح الجلسة
fr: Déverrouiller la session

# reauthNeedsInternet
source: Internet is required to unlock the session
ar: يلزم اتصال الإنترنت لفتح الجلسة
fr: Internet est requis pour déverrouiller la session

# logout
source: Sign out
ar: تسجيل الخروج
fr: Se déconnecter

# logoutSubtitle
source: End current session on this device
ar: إنهاء الجلسة الحالية على هذا الجهاز
fr: Terminer la session actuelle sur cet appareil

# registerTitle
source: Create account
ar: تسجيل جديد
fr: Créer un compte

# registerButton
source: Sign up
ar: تسجيل
fr: S’inscrire

# accountCreated
source: Account created successfully
ar: تم إنشاء الحساب بنجاح
fr: Compte créé avec succès

# signUpConfirmEmail
source: Account created. Please confirm your email and sign in.
ar: تم إنشاء الحساب. يرجى تأكيد البريد الإلكتروني ثم تسجيل الدخول.
fr: Compte créé. Veuillez confirmer l’e-mail puis vous connecter.

# signUpAuthSaveFailed
source: Failed to create account in Auth. Check Supabase Auth settings.
ar: فشل إنشاء الحساب في نظام المصادقة. تحقق من إعدادات Auth في Supabase.
fr: Échec de création dans Auth. Vérifiez Supabase Auth.

# signUpRateLimit
source: Email rate limit exceeded. Please try again later.
ar: تم تجاوز حد محاولات البريد. انتظر قليلًا ثم أعد المحاولة.
fr: Limite d’e-mails atteinte. Réessayez plus tard.

# signUpEmailNotConfirmed
source: Email must be confirmed before sign in.
ar: الحساب يحتاج تأكيد البريد الإلكتروني قبل تسجيل الدخول.
fr: L’e-mail doit être confirmé avant la connexion.

# signUpInvalidApiKey
source: Invalid Supabase API key in app settings.
ar: مفتاح Supabase غير صحيح في إعدادات التطبيق.
fr: Clé API Supabase invalide dans l’application.

# signUpEmailUsed
source: Email already registered.
ar: هذا البريد مسجل مسبقًا.
fr: E-mail déjà enregistré.

# signUpInvalidEmail
source: Invalid email format.
ar: صيغة البريد الإلكتروني غير صحيحة.
fr: Format d’e-mail invalide.

# signUpPasswordInvalid
source: Password does not meet requirements.
ar: كلمة المرور لا تحقق الشروط المطلوبة.
fr: Le mot de passe ne respecte pas les conditions.

# signUpFailed
source: Failed to create account: {error}
ar: تعذر إنشاء الحساب: {error}
fr: Échec de création : {error}

# resetPasswordTitle
source: Reset password
ar: استعادة كلمة المرور
fr: Réinitialiser le mot de passe

# enterEmail
source: Enter your email
ar: أدخل البريد الإلكتروني
fr: Entrez votre e-mail

# sendResetLink
source: Send link
ar: إرسال الرابط
fr: Envoyer le lien

source: Sending...
ar: جارٍ الإرسال...
fr: Envoi en cours...

# resetLinkSent
source: Password reset link sent
ar: تم إرسال رابط إعادة تعيين كلمة المرور
fr: Lien de réinitialisation envoyé

# resetLinkFailed
source: Failed to send link
ar: تعذر إرسال الرابط
fr: Échec de l’envoi du lien

# changePasswordTitle
source: Change password
ar: تغيير كلمة المرور
fr: Changer le mot de passe

# newPasswordLabel
source: New password
ar: كلمة المرور الجديدة
fr: Nouveau mot de passe

# confirmPasswordLabel
source: Confirm password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

# passwordMin
source: Password must be at least 8 characters
ar: كلمة المرور 8 أحرف على الأقل
fr: Le mot de passe doit contenir au moins 8 caractères

# passwordsNotMatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين
fr: Les mots de passe ne correspondent pas

source: Password updated
ar: تم تحديث كلمة المرور
fr: Mot de passe mis à jour

# passwordUpdateFailed
source: Failed to update password
ar: تعذر تحديث كلمة المرور
fr: Échec de la mise à jour

source: Save
ar: حفظ
fr: Enregistrer

source: Saving...
ar: جارٍ الحفظ...
fr: Enregistrement...

source: Update
ar: تحديث
fr: Mettre à jour

# settingsTitle
source: Settings
ar: الإعدادات
fr: Paramètres

# notificationsEnabledTitle
source: Enable notifications
ar: تفعيل الإشعارات
fr: Activer les notifications

# notificationsEnabledSubtitle
source: Turn local notifications on/off
ar: تشغيل/إيقاف الإشعارات المحلية
fr: Activer/désactiver les notifications locales

# reminderBeforeAppointment
source: {minutes} minutes before appointment
ar: قبل الموعد بـ {minutes} دقيقة
fr: {minutes} min avant le rendez-vous

# notificationLogTitle
source: Notification log
ar: سجل الإشعارات
fr: Historique des notifications

# notificationLogSubtitle
source: View recent notifications
ar: عرض الإشعارات الأخيرة داخل التطبيق
fr: Voir les notifications récentes

# notificationLogEmpty
source: No notifications yet
ar: لا توجد إشعارات بعد
fr: Aucune notification pour l’instant

# notificationLogLoadFailed
source: Failed to load log
ar: تعذر تحميل السجل
fr: Échec du chargement de l’historique

source: Clear all
ar: مسح الكل
fr: Tout effacer

# languageTitle
source: App language
ar: لغة التطبيق
fr: Langue de l’application

# changePasswordMenuTitle
source: Change password
ar: تغيير كلمة المرور
fr: Changer le mot de passe

# changePasswordMenuSubtitle
source: Update current password
ar: تعديل كلمة المرور الحالية
fr: Mettre à jour le mot de passe

# noteAutoSaveTitle
source: Auto-save note delay
ar: مدة حفظ الملاحظة تلقائيًا
fr: Délai d’enregistrement automatique

# noteAutoSaveSubtitle
source: After {ms}ms of inactivity
ar: بعد التوقف بـ {ms}ms
fr: Après {ms}ms d’inactivité

# syncEnabledTitle
source: Enable sync
ar: تفعيل المزامنة
fr: Activer la synchronisation

# syncEnabledSubtitle
source: Auto sync every 5 minutes + Realtime
ar: مزامنة تلقائية كل 5 دقائق + Realtime
fr: Sync auto toutes les 5 minutes + Realtime

# lastSyncTitle
source: Last sync
ar: آخر مزامنة
fr: Dernière synchronisation

# lastSyncNever
source: Not synced yet
ar: لم تتم مزامنة بعد
fr: Pas encore synchronisé

# lastSyncLoading
source: Loading...
ar: جارٍ التحميل...
fr: Chargement...

# lastSyncUnavailable
source: Unavailable
ar: غير متاح
fr: Indisponible

source: Sync now
ar: مزامنة الآن
fr: Synchroniser maintenant

# syncDone
source: Sync completed
ar: تمت المزامنة
fr: Synchronisation terminée

source: Choose language
ar: اختر اللغة
fr: Choisir la langue

source: Use device language
ar: استخدام لغة الجهاز
fr: Utiliser la langue de l’appareil

# langArabic
source: Arabic
ar: العربية
fr: Arabe

# langFrench
source: French
ar: Français
fr: Français

# chooseReminder
source: Choose reminder time
ar: اختر مدة التذكير
fr: Choisir le rappel

# chooseNoteDelay
source: Choose note save delay
ar: اختر مدة حفظ الملاحظة
fr: Choisir le délai

# minutesUnit
source: min
ar: دقيقة

# millisecondsUnit
source: ms
ar: مللي ثانية

# therapistsTitle
source: Therapists
ar: إدارة المختصين
fr: Kinésithérapeutes

# addTherapist
source: Add new therapist
ar: إضافة مختص جديد
fr: Ajouter un kiné

# therapistFormTitleAdd
source: Add therapist
ar: إضافة مختص
fr: Ajouter un kiné

# therapistFormTitleEdit
source: Edit therapist
ar: تعديل مختص
fr: Modifier le kiné

# phoneLabel
source: Phone
ar: رقم الهاتف
fr: Téléphone

# userIdLabel
source: User ID (Supabase Auth)
ar: User ID (من Supabase Auth)
fr: ID utilisateur (Supabase Auth)

# adminRoleLabel
source: Admin role
ar: صلاحية المسؤول
fr: Rôle admin

source: Primary
ar: رئيسي
fr: Principal

source: Therapist
ar: مختص
fr: Kiné

source: Make admin
ar: تعيين كمسؤول
fr: Rendre admin

source: Remove admin
ar: إزالة صلاحية المسؤول
fr: Retirer admin

# maxAdmins
source: Maximum admins is 2
ar: الحد الأقصى للمسؤولين هو 2
fr: Maximum d’admins : 2

# minOneAdmin
source: At least one admin is required
ar: يجب أن يبقى مسؤول واحد على الأقل
fr: Au moins un admin est requis

source: Confirm
ar: تأكيد
fr: Confirmer

source: Cancel
ar: إلغاء
fr: Annuler

# confirmMakeAdmin
source: Grant admin to {name}?
ar: هل تريد منح {name} صلاحية المسؤول؟
fr: Accorder admin à {name} ?

# confirmRemoveAdmin
source: Remove admin from {name}?
ar: هل تريد إزالة صلاحية المسؤول من {name}؟
fr: Retirer admin de {name} ?

# adminGranted
source: Granted admin to {name}
ar: تم منح {name} صلاحية المسؤول
fr: Admin accordé à {name}

# adminRemoved
source: Removed admin from {name}
ar: تمت إزالة صلاحية المسؤول من {name}
fr: Admin retiré à {name}

# updateAdminFailed
source: Failed to update admin role: {error}
ar: تعذر تحديث صلاحية المسؤول: {error}
fr: Échec de mise à jour admin : {error}

# loadTherapistsFailed
source: Failed to load therapists
ar: تعذر تحميل المختصين
fr: Échec du chargement

# inviteTherapistTitle
source: Invite therapist
ar: دعوة مختص جديد
fr: Inviter un kiné

# fullNameLabel
source: Full name
ar: الاسم الكامل
fr: Nom complet

# nameRequired
source: Name is required
ar: الاسم مطلوب
fr: Nom requis

# emailRequired
source: Email is required
ar: البريد مطلوب
fr: E-mail requis

source: Invalid email
ar: بريد غير صالح
fr: E-mail invalide

# tempPasswordLabel
source: Temporary password
ar: كلمة المرور المؤقتة
fr: Mot de passe temporaire

# tempPasswordMin
source: Password must be at least 8 characters
ar: كلمة المرور يجب أن تكون 8 أحرف على الأقل
fr: Le mot de passe doit contenir 8 caractères

# createTherapistSuccess
source: Therapist account created
ar: تم إنشاء حساب المختص بنجاح
fr: Compte créé

source: Create therapist
ar: إنشاء حساب مختص
fr: Créer un compte

source: Creating...
ar: جارٍ الإنشاء...
fr: Création...

# inviteNote
source: Note: This screen depends on the admin-create-user Edge Function.
ar: ملاحظة: هذه الشاشة تعتمد على Edge Function باسم admin-create-user.
fr: Note : cet écran dépend de la fonction admin-create-user.

# inviteNoPermission
source: You don't have permission
ar: لا تملك صلاحية إنشاء مختصين
fr: Vous n’avez pas la permission

# inviteServerKeyMissing
source: Server config error: service key missing
ar: خطأ إعدادات السيرفر: مفتاح الخدمة غير مضبوط
fr: Erreur serveur : clé manquante

# inviteSessionExpired
source: Session expired. Please sign in again
ar: انتهت الجلسة، سجّل الدخول مرة أخرى
fr: Session expirée. Reconnectez-vous

# inviteInvalidPayload
source: Check name, email and password (min 8 chars)
ar: تأكد من الاسم والبريد وكلمة المرور (8 أحرف على الأقل)
fr: Vérifiez nom, e-mail et mot de passe (8 caractères)

# inviteCreateFailed
source: Failed to create account in Supabase
ar: تعذر إنشاء الحساب في Supabase
fr: Échec de création dans Supabase

# inviteEmailUsed
source: Email already used
ar: البريد الإلكتروني مستخدم مسبقًا
fr: E-mail déjà utilisé

# inviteFailed
source: Failed to create account: {error}
ar: تعذر إنشاء الحساب: {error}
fr: Échec de création : {error}

# statsTitle
source: Statistics
ar: الإحصائيات
fr: Statistiques

source: Sessions stats
ar: إحصائيات الجلسات
fr: Stats des séances

source: Total sessions
ar: عدد الجلسات الإجمالي
fr: Total des séances

source: Sessions (male)
ar: عدد الجلسات للرجال
fr: Séances hommes

source: Sessions (female)
ar: عدد الجلسات للنساء
fr: Séances femmes

source: Sessions (child)
ar: عدد الجلسات للأطفال
fr: Séances enfants

source: Sessions ratio
ar: نسب الجلسات
fr: Répartition des séances

source: Patients stats
ar: إحصائيات المرضى
fr: Stats des patients

source: Total patients
ar: عدد المرضى الكلي

# patientsMale
source: Male patients
ar: عدد المرضى الرجال
fr: Patients hommes

# patientsFemale
source: Female patients
ar: عدد المرضى النساء
fr: Patients femmes

# patientsChild
source: Child patients
ar: عدد المرضى الأطفال
fr: Patients enfants

source: Patients ratio
ar: نسب المرضى
fr: Répartition des patients

# statsLoadFailed
source: Failed to load stats: {error}
ar: تعذر تحميل الإحصائيات: {error}
fr: Échec chargement stats : {error}

# statsByTherapist
source: By therapist
ar: حسب المختص
fr: Par kiné

source: Monthly
ar: شهري
fr: Mensuel

source: Yearly
ar: سنوي
fr: Annuel

source: Overall
ar: كلّي
fr: Global

# yearLabel
source: Year
ar: السنة
fr: Année

# monthLabel
source: Month
ar: الشهر
fr: Mois

source: Male
ar: رجال
fr: Hommes

source: Female
ar: نساء
fr: Femmes

source: Child
ar: أطفال
fr: Enfants

# totalLabel
source: Total {total}
ar: المجموع {total}

# patientsTitle
source: Patients
ar: المرضى

# patientSearchHint
source: Search by name, diagnosis, or doctor
ar: بحث بالاسم أو التشخيص أو الطبيب
fr: Rechercher par nom, diagnostic ou médecin

# filterAll
source: All
ar: الكل
fr: Tous

# filterMale
source: Male
ar: ذكر
fr: Homme

# filterFemale
source: Female
ar: أنثى
fr: Femme

# filterChild
source: Child
ar: طفل
fr: Enfant

source: Currently treating
ar: يعالجون الآن
fr: En traitement

source: Finished treatment
ar: أنهوا العلاج
fr: Traitement terminé

source: No results
ar: لا توجد نتائج مطابقة
fr: Aucun résultat

# patientAgeDiagnosis
source: Age: {age} • Diagnosis: {diagnosis}
ar: العمر: {age} • التشخيص: {diagnosis}
fr: Âge : {age} • Diagnostic : {diagnosis}

# patientTherapist
source: Therapist: {name}
ar: المختص: {name}
fr: Kiné : {name}

# unassignedTherapist
source: Unscheduled / no therapist
ar: غير مبرمج/بدون مختص

source: Details
ar: تفاصيل
fr: Détails

# loadPatientsFailed
source: Failed to load patients
ar: تعذر تحميل المرضى
fr: Échec du chargement des patients

# deletePatientTitle
source: Delete patient
ar: حذف المريض
fr: Supprimer le patient

# deletePatientConfirm
source: Do you want to delete this patient?
ar: هل تريد حذف هذا المريض؟
fr: Supprimer ce patient ?

source: Delete
ar: حذف
fr: Supprimer

# patientFormTitleAdd
source: Add patient
ar: إضافة مريض
fr: Ajouter un patient

# patientFormTitleEdit
source: Edit patient
ar: تعديل مريض
fr: Modifier le patient

# noTherapistsYet
source: No therapists yet. Add a therapist first.
ar: لا يوجد مختصون بعد. أضف مختصًا أولًا قبل إنشاء مريض.
fr: Aucun kiné. Ajoutez-en un d’abord.

# fullNameRequired
source: Full name is required
ar: الاسم الكامل مطلوب
fr: Nom complet requis

# nameTooShort
source: Name is too short
ar: الاسم قصير جدًا
fr: Nom trop court

# ageLabel
source: Age
ar: العمر
fr: Âge

# ageMustBeNumber
source: Age must be a number
ar: العمر يجب أن يكون رقمًا
fr: L’âge doit être un nombre

# ageInvalid
source: Invalid age
ar: العمر غير صالح
fr: Âge invalide

# genderLabel
source: Gender
ar: الجنس
fr: Sexe

# patientStatusLabel
source: Patient status
ar: حالة المريض
fr: Statut du patient

# statusActive
source: Active
ar: نشط
fr: Actif

# statusCompleted
source: Completed
ar: منتهي
fr: Terminé

# statusSuspended
source: Suspended
ar: معلق
fr: Suspendu

# diagnosisLabel
source: Diagnosis
ar: التشخيص
fr: Diagnostic

source: Advanced filters
ar: فلاتر متقدمة
fr: Filtres avancés

# diagnosisFilterLabel
source: Filter by diagnosis
ar: تصفية حسب التشخيص
fr: Filtrer par diagnostic

# doctorFilterLabel
source: Filter by doctor
ar: تصفية حسب الطبيب
fr: Filtrer par médecin

# recurrenceLabel
source: Recurrence
ar: تكرار المواعيد
fr: Récurrence

# recurrenceWeekly
source: Weekly
ar: أسبوعي
fr: Hebdomadaire

# recurrenceWeekdays
source: Specific weekdays
ar: أيام محددة
fr: Jours spécifiques

# weekdayMon
source: Mon
ar: الإثنين
fr: Lun

# weekdayTue
source: Tue
ar: الثلاثاء
fr: Mar

# weekdayWed
source: Wed
ar: الأربعاء
fr: Mer

# weekdayThu
source: Thu
ar: الخميس
fr: Jeu

# weekdayFri
source: Fri
ar: الجمعة
fr: Ven

# weekdaySat
source: Sat
ar: السبت
fr: Sam

# weekdaySun
source: Sun
ar: الأحد
fr: Dim

# medicalHistoryLabel
source: Medical history
ar: السوابق الطبية
fr: Antécédents médicaux

# suggestedSessionsLabel
source: Suggested sessions
ar: عدد الجلسات المقترحة
fr: Séances proposées

# sessionsMustBeNumber
source: Sessions must be a number
ar: عدد الجلسات يجب أن يكون رقمًا
fr: Le nombre doit être un nombre

# sessionsInvalid
source: Invalid sessions count
ar: عدد الجلسات غير صالح
fr: Nombre de séances invalide

# therapistLabel
source: Therapist
ar: المختص المعالج
fr: Kiné

# noTherapistOption
source: No therapist
ar: بدون مختص
fr: Sans kiné

# therapistRequired
source: Select therapist
ar: اختر المختص المعالج
fr: Choisir un kiné

# createInitialAppointment
source: Create first appointment
ar: إنشاء موعد أول للمريض
fr: Créer le premier rendez-vous

# createInitialAppointmentSubtitle
source: Assign appointment to selected therapist
ar: توزيع الموعد مباشرة على المختص المحدد
fr: Assigner au kiné sélectionné

# createAllAppointments
source: Create all appointments by sessions
ar: إنشاء جميع المواعيد حسب عدد الجلسات
fr: Créer tous les rendez-vous

# createAllAppointmentsSubtitle
source: Appointments will be scheduled weekly
ar: سيتم جدولة المواعيد أسبوعيًا
fr: Rendez-vous hebdomadaires

source: First appointment date/time
ar: تاريخ ووقت الموعد الأول
fr: Date/heure du premier rendez-vous

# doctorNameLabel
source: Doctor name
ar: اسم الطبيب المعالج
fr: Médecin traitant

# updatedPatient
source: Patient updated
ar: تم تحديث المريض
fr: Patient mis à jour

# addedPatientWithFirstAppointment
source: Patient added with first appointment
ar: تمت إضافة المريض مع موعده الأول
fr: Patient ajouté avec premier rendez-vous

# addedPatient
source: Patient added
ar: تمت إضافة المريض
fr: Patient ajouté

# therapistRequiredFirst
source: Select therapist first
ar: اختر المختص المعالج أولاً
fr: Choisir le kiné d’abord

# savePatientFailed
source: Failed to save patient: {error}
ar: تعذر حفظ بيانات المريض: {error}
fr: Échec d’enregistrement : {error}

# prescriptionImageTitle
source: Prescription image
ar: صورة الوصفة الطبية
fr: Ordonnance

# noImage
source: No image yet
ar: لا توجد صورة بعد
fr: Aucune image

source: Take photo
ar: التقاط صورة
fr: Prendre une photo

source: Remove
ar: إزالة
fr: Retirer

# patientDetailsTitle
source: Patient details
ar: تفاصيل المريض
fr: Détails du patient

# loadPatientDetailsFailed
source: Failed to load patient details
ar: تعذر تحميل تفاصيل المريض
fr: Échec chargement détails

# patientAuditTitle
source: Patient change log
ar: سجل تغييرات المريض
fr: Historique des modifications

# patientAuditEmpty
source: No changes recorded yet
ar: لا توجد تغييرات مسجلة بعد
fr: Aucune modification enregistrée

# auditCreated
source: Patient created
ar: تم إنشاء المريض
fr: Patient créé

# auditUpdated
source: Patient updated
ar: تم تعديل المريض
fr: Patient modifié

# auditDeleted
source: Patient deleted
ar: تم حذف المريض
fr: Patient supprimé

# ageValue
source: Age: {age}
ar: العمر: {age}
fr: Âge : {age}

# genderValue
source: Gender: {gender}
ar: الجنس: {gender}
fr: Sexe : {gender}

# diagnosisValue
source: Diagnosis: {diagnosis}
ar: التشخيص: {diagnosis}
fr: Diagnostic : {diagnosis}

# medicalHistoryValue
source: Medical history: {history}
ar: السوابق الطبية: {history}
fr: Antécédents : {history}

# doctorValue
source: Doctor: {doctor}
ar: الطبيب: {doctor}
fr: Médecin : {doctor}

# phoneValue
source: Phone: {phone}
ar: الهاتف: {phone}
fr: Téléphone : {phone}

source: Call patient
ar: اتصال بالمريض
fr: Appeler le patient

source: Call therapist
ar: اتصال بالمختص
fr: Appeler le kiné

# callFailed
source: Could not start phone call
ar: تعذر بدء الاتصال
fr: Impossible de lancer l'appel

# prescriptionTitle
source: Prescription
ar: الوصفة الطبية
fr: Ordonnance

source: Completed
ar: مكتمل
fr: Terminé

source: Missed
ar: غياب
fr: Absent

source: Remaining
ar: المتبقي
fr: Restant

# newAppointmentForPatient
source: New appointment for this patient
ar: موعد جديد لهذا المريض
fr: Nouveau rendez-vous

# editPatientData
source: Edit patient
ar: تعديل بيانات المريض
fr: Modifier le patient

source: Upcoming appointments
ar: المواعيد القادمة
fr: Rendez-vous à venir

source: No upcoming appointments
ar: لا توجد مواعيد قادمة
fr: Aucun rendez-vous à venir

# sessionsHistory
source: Session history
ar: سجل الجلسات
fr: Historique des séances

source: No sessions yet
ar: لا يوجد سجل جلسات بعد
fr: Aucune séance

# attendancePresent
source: Present
ar: حضر
fr: Présent

# attendanceAbsent
source: Absent
ar: غياب

# attendanceUnknown
source: Unknown
ar: غير مؤكد
fr: Non confirmé

# appointmentSubtitle
source: Appointment: {scheduled} Status: {status} • Attendance: {attendance} Note: {note}
ar: الموعد: {scheduled} الحالة: {status} • الحضور: {attendance} ملاحظة: {note}
fr: Rendez-vous : {scheduled} Statut : {status} • Présence : {attendance} Note : {note}

source: Scheduled
ar: مجدول
fr: Planifié

source: Canceled
ar: ملغى
fr: Annulé

# appointmentsTitle
source: Appointments
ar: المواعيد
fr: Rendez-vous

# noPatientsForAppointments
source: Add a patient first before creating appointments
ar: أضف مريضًا أولاً قبل إنشاء موعد
fr: Ajoutez d'abord un patient avant de créer un rendez-vous

source: Pick date
ar: اختيار تاريخ
fr: Choisir la date

source: Unknown patient
ar: مريض غير معروف
fr: Patient inconnu

# therapistWithTime
source: Therapist: {name} • {time}
ar: المختص: {name} • {time}
fr: Kiné : {name} • {time}

source: Edit
ar: تعديل
fr: Modifier

# deleteAction
source: Delete
ar: حذف
fr: Supprimer

# loadAppointmentsFailed
source: Failed to load appointments
ar: تعذر تحميل المواعيد
fr: Échec chargement rendez-vous

source: Add appointment
ar: إضافة موعد جديد
fr: Ajouter un rendez-vous

# filterAllLabel
source: All
ar: الكل
fr: Tous

# filterScheduled
source: Scheduled
ar: مجدول
fr: Planifié

# filterCompleted
source: Completed
ar: مكتمل
fr: Terminé

# filterMissed
source: Missed
ar: غياب
fr: Absent

# filterCanceled
source: Canceled
ar: ملغى
fr: Annulé

# appointmentFormTitleAdd
source: Add appointment
ar: إضافة موعد
fr: Ajouter un rendez-vous

# appointmentFormTitleEdit
source: Edit appointment
ar: تعديل موعد
fr: Modifier le rendez-vous

# patientLabel
source: Patient
ar: المريض

# therapistLabelShort
source: Therapist
ar: المختص
fr: Kiné

source: Appointment date/time
ar: تاريخ ووقت الموعد
fr: Date/heure du rendez-vous

# dateLabel
source: Date (YYYY-MM-DD)
ar: التاريخ (YYYY-MM-DD)

# timeLabel
source: Time (HH:mm)
ar: الوقت (HH:mm)
fr: Heure (HH:mm)

# statusLabel
source: Status
ar: الحالة
fr: Statut

# pickPatientTherapist
source: Select patient and therapist first
ar: اختر المريض والمختص أولاً
fr: Choisissez patient et kiné

source: Appointment updated
ar: تم تعديل الموعد
fr: Rendez-vous modifié

source: Appointment created
ar: تم إنشاء موعد
fr: Rendez-vous créé

# appointmentUpdatedWithReminder
source: Appointment updated (reminder: {minutes} min)
ar: تم تعديل الموعد (تذكير: {minutes} دقيقة)
fr: Rendez-vous modifié (rappel : {minutes} min)

# appointmentCreatedWithReminder
source: Appointment created after {minutes} min
ar: تم إنشاء موعد بعد {minutes} دقيقة
fr: Rendez-vous créé dans {minutes} min

# reminderTitle
source: Appointment reminder
ar: تذكير بالموعد
fr: Rappel de rendez-vous

# reminderBody
source: You have an appointment in {minutes} minutes
ar: لديك موعد بعد {minutes} دقيقة
fr: Vous avez un rendez-vous dans {minutes} minutes

# reminderBodyNoName
source: Your appointment at {time} (in {minutes} min)
ar: موعدك الساعة {time} (بعد {minutes} دقيقة)
fr: Votre rendez-vous à {time} (dans {minutes} min)

# reminderBodyWithName
source: Appointment for {name} at {time} (in {minutes} min)
ar: موعد {name} الساعة {time} (بعد {minutes} دقيقة)
fr: Rendez-vous pour {name} à {time} (dans {minutes} min)

# syncCompleteTitle
source: Sync completed
ar: تمت المزامنة
fr: Synchronisation terminée

# syncCompleteBody
source: Data updated successfully
ar: تم تحديث البيانات بنجاح
fr: Données mises à jour avec succès

# invalidDate
source: Invalid date format
ar: صيغة التاريخ غير صحيحة
fr: Format de date invalide
