Repository: bouhenni1982/physio_manager
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# invalidTime
source: Invalid time format
ar: صيغة الوقت غير صحيحة
fr: Format d’heure invalide

# invalidTimeValue
source: Invalid time
ar: الوقت غير صالح
fr: Heure invalide

# appointmentDetailsTitle
source: Appointment details
ar: تفاصيل الموعد
fr: Détails du rendez-vous

# patientLabelValue
source: Patient: {name}
ar: المريض: {name}

# therapistLabelValue
source: Therapist: {name}
ar: المختص: {name}
fr: Kiné : {name}

# timeLabelValue
source: Time: {time}
ar: الوقت: {time}
fr: Heure : {time}

# statusLabelValue
source: Status: {status}
ar: الحالة: {status}
fr: Statut : {status}

source: Mark present
ar: تأشير حضور
fr: Marquer présent

source: Mark absent
ar: تسجيل غياب
fr: Marquer absence

source: Note saved
ar: تم حفظ الملاحظة
fr: Note enregistrée

# noteSavedFor
source: Session note saved for {name}
ar: تم حفظ ملاحظة جلسة {name}
fr: Note enregistrée pour {name}

source: Attendance marked
ar: تم تأشير الحضور
fr: Présence marquée

source: Absence marked
ar: تم تسجيل الغياب
fr: Absence marquée

source: Session details
ar: تفاصيل الجلسة
fr: Détails de la séance

# attendance
source: Attendance: {value}
ar: الحضور: {value}
fr: Présence : {value}

# sessionTime
source: Time: {time}
ar: الوقت: {time}
fr: Heure : {time}

source: Session note
ar: ملاحظة الجلسة
fr: Note de séance

# noSessionDetails
source: No session details yet
ar: لا توجد تفاصيل جلسة بعد
fr: Pas encore de détails

# dashboardToday
source: Today
ar: اليوم
fr: Aujourd’hui

# dashboardAppointments
source: Appointments
ar: المواعيد
fr: Rendez-vous

# dashboardPatients
source: Patients
ar: المرضى

# dashboardTherapists
source: Therapists
ar: المختصون
fr: Kinés

# dashboardStats
source: Statistics
ar: الإحصائيات
fr: Statistiques

# dashboardSettings
source: Settings
ar: الإعدادات
fr: Paramètres

# dashboardCustomizeTitle
source: Customize dashboard
ar: تخصيص الشاشة الرئيسية
fr: Personnaliser le tableau de bord

# dashboardCustomizeSubtitle
source: Show/hide and reorder tabs
ar: إظهار/إخفاء وترتيب التبويبات
fr: Afficher/masquer et réordonner les onglets

# todaySessions
source: Today's sessions
ar: جلسات اليوم
fr: Séances du jour

source: No sessions today
ar: لا توجد جلسات في هذا اليوم
fr: Aucune séance aujourd’hui

# loadTodayPatientsFailed
source: Failed to load patients
ar: تعذر تحميل المرضى
fr: Échec chargement patients

# loadTodayAppointmentsFailed
source: Failed to load today's appointments
ar: تعذر تحميل مواعيد اليوم
fr: Échec chargement rendez-vous

# timeStatusLine
source: Time: {time} • Status: {status}
ar: الوقت: {time} • الحالة: {status}
fr: Heure : {time} • Statut : {status}

# langEnglish
source: English
fr: Anglais
